uni/informatik/2020-betriebssysteme/00_uebung.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-18 Sat 13:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Doe" />
</head>
<body>
<div id="content">

<div id="outline-container-orgc945838" class="outline-2">
<h2 id="orgc945838">Übung 00 - Selbsttest</h2>
<div class="outline-text-2" id="text-orgc945838">
<ol class="org-ol">
<li>Welche Aussagen sind korrekt?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">Eine Graph ist auch ein Baum. Ein Baum ist auch ein Liste.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Bäume sind immer schneller durchsuchbar als Listen gleicher Größe.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Bäume haben immer ein Ordnungskriterium.</font></li>
<li class="on"><code>[X]</code> <font color="green">Eine Liste ist auch ein Baum. Ein Baum ist auch ein Graph.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
</ul></li>

<li>Was drückt dieser Code aus: for(1..4) { 90m geradeaus\, links abbiegen }
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Es ist ein Suchverfahren nach einem Ziel.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Es handelt sich um eine formale Beschreibung.</font></li>
<li class="on"><code>[X]</code> <font color="green">Es handelt sich um einen Weg zurück zum Startpunkt.</font></li>
<li class="on"><code>[X]</code> <font color="green">Es ist eine Wegbeschreibung.</font></li>
</ul></li>

<li>Bei folgender Beschreibung handelt es sich um?
<ol class="org-ol">
<li>Füge den Startknoten zu einer leeren Liste hinzu. Sie dient der Speicherung von zu bearbeitenden Knoten.</li>
<li>Wenn die Liste leer ist\, bist du fertig Ende.</li>
<li>Entnehme den zuletzt zur Liste hinzugefügten Knoten A aus der Liste.</li>
<li>Ist A der gesuchte Knoten\, bist du fertig Ende.</li>
<li>Wurde A bereits markiert: springe zu 2.</li>
<li>Füge alle Knoten\, die von A aus erreicht werden können\, zur Liste hinzu.</li>
<li>Markiere A.</li>
<li>Springe zu 2.
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">der Heap Suche.</font></li>
<li class="on"><code>[X]</code> <font color="green">der Tiefensuche.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">das Sortieren einer Liste.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">der Breitensuche.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
</ul></li>
</ol></li>

<li>Welche der beschriebenen Vorgehensweisen sind sinnvoll?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">Namen müssen kurz sein um die Performance zu verbessern.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
<li class="on"><code>[X]</code> <font color="green">Wenn möglich, sollten - entsprechend der Fragestellung - bereits in Bibliotheken vorhandene Datenstrukturen und Algorithmen genutzt werden.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Funktionierender Code sollte zur Vermeidung von Tippfehlern möglichst per Cut & Paste kopiert werden.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Die Lösung von Stack-Overflow-Fragen sollte ab einer Bewertung von 50 Punkten direkt genutzt werden.</font></li>
</ul></li>

<li>Welches Vorgehen ist korrekt\, um ein ausführbares Programm in C zu erstellen?
<ul class="org-ul">
<li class="on"><code>[X]</code> <font color="green">IDE benutzen und Reihenfolge automatisieren, wenn man sich des zugrundeliegenden Vorgangs bewusst ist</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">schreiben, assemblieren, automatische Textersetzung mit Präprozessor, compilieren, linken</font></li>
<li class="on"><code>[X]</code> <font color="green">schreiben, automatische Textersetzung mit Präprozessor, compilieren, assemblieren, linken</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">schreiben, automatische Textersetzung mit Präprozessor, compilieren, linken, assemblieren</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
</ul></li>

<li>Welche Aussagen sind korrekt? &ldquo;man man&rdquo; &#x2026;
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">entspricht "man -h"</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">funktioniert auch als "frau frau".</font></li>
<li class="on"><code>[X]</code> <font color="green">erklärt, wie Sie das Werkzeug zum Lesen von Bedienungsanleitungen verwenden können.</font></li>
<li class="on"><code>[X]</code> <font color="green">funktioniert nicht auf jedem Betriebssystem.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
</ul></li>

<li><code>cat ~/.ssh/known_hosts | sort | uniq | wc -l  ...</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">signalisiert ein away from keyboard (AFK).</font></li>
<li class="on"><code>[X]</code> <font color="green">zeigt an, mit wie vielen verschiedenen Systemen Sie sich per SSH ohne Sicherheitsabfrage verbinden können.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">zeigt an, von wie vielen Systemen Sie sich per SSH auf diesem System angemeldet haben.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">zeigt an, wie oft Sie sich mit anderen Systemen per SSH verbunden haben.</font></li>
</ul></li>

<li>Ein Page Fault &#x2026;
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">zeigt immer an, dass die Seite im Speicher noch nie zur Verfügung stand.</font></li>
<li class="on"><code>[X]</code> <font color="green">zeigt an, dass die angeforderte Seite im Speicher nicht zur Verfügung steht.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">zeigt immer an, dass die Seite im Speicher von einem anderen Prozess verdrängt wurde.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">zeigt immer an, dass keine Berechtigung für die angeforderte Seite im Speicher besteht (Schutzverletzung).</font></li>
</ul></li>

<li>Ein Page Fault wird ausgelöst von&#x2026;
<ul class="org-ul">
<li class="on"><code>[X]</code> <font color="green">der MMU</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">der ALU</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">dem Mikroprogrammspeicher</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">dem Betriebssystem.</font></li>
</ul></li>

<li>Die MMU ist die &#x2026;
<ul class="org-ul">
<li class="on"><code>[X]</code> <font color="green">memory management unit.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">man man unit.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">multi management unit.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">monochrome management unit.</font></li>
</ul></li>

<li>Welche Aussagen sind korrekt?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">Eine Trap wird immer von externen Ereignissen ausgelöst.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Ein Interrupt wird immer von internen Ereignissen ausgelöst.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Trap ist ein Oberbegriff für hardwaregesteuerte Exceptions in Programmiersprachen, die das Exception-Konzept kennen (z.B. Java, C++, ...)</font></li>
<li class="on"><code>[X]</code> <font color="green">Interrupt und Trap werden konzeptionell gleich von der CPU verarbeitet.</font></li>
</ul></li>

<li>Was unterscheidet die von-Neumann- und die Harvard-Architektur?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">Ob es nur einen oder mehrere ALUs gibt.</font></li>
<li class="on"><code>[X]</code> <font color="green">Ob Befehls- und Datenspeicher gemeinsam oder getrennt sind</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Ob die Maschinenbefehle durch Mikrocode oder festverdrahtet realisiert werden</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Ob ein mehrstufiger oder nur einstufiger/kein Cache vorhanden ist</font></li>
</ul></li>

<li>Welche Aussagen über die von-Neumann- und die Harvard-Architektur sind korrekt?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">Die Harvard-Architektur ist nicht Turing-vollständig, da die Befehle von den Daten getrennt sind und nicht programmintern veränderbar sind.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Die von-Neumann-Architektur kann mit Nebenläufigkeit besser umgehen als die Harvard-Architektur</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Die Harvard-Architektur ist die akademische Variante und wird daher in der Lehre bevorzugt.</font></li>
<li class="on"><code>[X]</code> <font color="green">Keine der anderen Antworten ist korrekt.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Die von-Neumann-Architektur ist effizienter, da kein zweiter Speicher benötigt wird.</font></li>
</ul></li>

<li>Welche Aussage(n) gehört/gehören <b>nicht</b> zu den von-Neumann-Prinzipien?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <font color="red">Der Rechner verarbeitet externe Programme, die intern gespeichert werden</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Programme werden sequentiell abgearbeitet. Der Programmfluss kann durch Sprünge verändert werden.</font></li>
<li class="on"><code>[X]</code> <font color="green">Die Ein- und Ausgabe erfolgt über Polling oder Interrupt-gesteuert.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Die Zentraleinheit arbeitet taktgesteuert.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Die Signale werden binär codiert.</font></li>
<li class="on"><code>[X]</code> <font color="green">Der Speicher ist über einen Cache zeitlich entkoppelt.</font></li>
<li class="off"><code>[&#xa0;]</code> <font color="red">Keine der anderen Antworten ist korrekt.</font></li>
</ul></li>

<li>Wie lautet der Standart-Zyklus der CPU?
<ol class="org-ol">
<li>Fetch</li>
<li>Execute</li>
<li>Interrupt Processing</li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2020-04-18 Sat 13:14</p>
</div>
</body>
</html>
